import telebot
import time
import logging
import telegram
from telebot import types
from telegram import ChatAction
from functools import wraps
from telegram.ext import Updater, CommandHandler, MessageHandler, Filters, ConversationHandler, RegexHandler

bot = telebot.TeleBot('979702529:AAH4qmbfJ-ayV4fzWTgdD53ghpHjsAXysTs') #токен
#Это для себя system
#C:\Users\Hirata\Desktop\bot.py\bot.py

#cd C:\Users\Hirata\Desktop\bot.py
#git commit -am "make it better"
#git push heroku master
#heroku ps:scale worker=1

#BOT version 0.1.7(587)
#BOT version 0.1.8(847)
#BOT version 0.1.9(1126)

@bot.message_handler(commands=['start'])
def register(message):
    bot.send_message(message.from_user.id,'Привет! Тебе нужна программа тренировок или питания?', reply_markup=keyboard10)
    bot.register_next_step_handler(message, register2)

@bot.message_handler(commands=['help'])
def register(message):
    bot.send_message(message.from_user.id,'Привет! Я помогу тебе составить личный план тренировок \
    или питания, исходя из введенных тобой параметров. Если готов, то нажми /start', reply_markup=keyboard11)


@bot.message_handler(content_types=['text'])
def register2(message):
    global register
    if message.text == 'Питание':
        bot.send_message(message.from_user.id,'Сколько ты в высоту в сантиметрах?')
        bot.register_next_step_handler(message, get_height)
    elif message.text == 'Тренировка':
        bot.send_message(message.from_user.id,'Выбери свой пол', reply_markup=keyboard1)
        bot.register_next_step_handler(message, get_sex)

def get_sex(message):
    global sex
    sex = message.text
    bot.send_message(message.from_user.id, 'Твоя цель?', reply_markup=keyboard2)
    bot.register_next_step_handler(message, get_aim)

def get_aim(message):
    global aim
    aim = message.text
    bot.send_message(message.from_user.id,'Где ты будешь тренироваться?', reply_markup=keyboard3)
    bot.register_next_step_handler(message, get_placing)

def get_placing(message):
    global placing
    placing = message.text
    bot.send_message(message.from_user.id,'Сколько раз в неделю ты планируешь тренироваться?', reply_markup=keyboard8)
    bot.register_next_step_handler(message, get_time)

def get_time(message):
    global time
    time = message.text
    if sex == 'парень' and aim == 'подсушиться' and placing == 'в зале' and time == '1 раз': #1.1#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time20+'_ \n\n3) '+Скручиваниянаскамье+'\n _'+up15f20+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up15f20+'_ \n\n5) '+Приседсоштангой+'\n _'+up15f20+'_ \n\n6) '+Жимлежа+'\n _'+up15f20+'_ \
        \n\n7) '+Тягаверхнегоблока+'\n _'+up15f20+'_ \n\n8) '+Подтягиванияобратнымхватом+'\n _'+up15f20+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'держать форму' and placing == 'в зале' and time == '1 раз': #1.2#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time10+'_ \n\n3) '+Скручиваниянаскамье+'\n _'+up10f12+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up10f12+'_ \n\n5) '+Приседсоштангой+'\n _'+up10f12+'_ \n\n6) '+Жимлежа+'\n _'+up10f12+'_ \
        \n\n7) '+Тягаверхнегоблока+'\n _'+up10f12+'_ \n\n8) '+Подтягиванияобратнымхватом+'\n _'+up10f12+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'подкачаться' and placing == 'в зале' and time == '1 раз': #1.3#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time5+'_ \n\n3) '+Скручиваниянаскамье+'\n _'+up8f10+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up8f10+'_ \n\n5) '+Приседсоштангой+'\n _'+up8f10+'_ \n\n6) '+Жимлежа+'\n _'+up8f10+'_ \
        \n\n7) '+Тягаверхнегоблока+'\n _'+up8f10+'_ \n\n8) '+Подтягиванияобратнымхватом+'\n _'+up8f10+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

############################################################################################################################

    elif sex == 'парень' and aim == 'подсушиться' and placing == 'дома' and time == '1 раз': #2.1#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time20+'_ \n\n3) '+Берпи+'\n _'+up15f20+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up15f20+'_ \n\n5) '+Приседания+'\n _'+up15f20+'_ \n\n6) '+Отжимания+'\n _'+up15f20+'_ \
        \n\n7) '+Охотничьясобака+'\n _'+up15f20+'_ \n\n8) '+Обратныеотжиманияотстула+'\n _'+up15f20+'_ \n\n9) '+Велосипед+'\n _'+up15f20+'_ \n\n10) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'держать форму' and placing == 'дома' and time == '1 раз': #2.2#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time10+'_ \n\n3) '+Берпи+'\n _'+up10f12+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up10f12+'_ \n\n5) '+Приседания+'\n _'+up10f12+'_ \n\n6) '+Отжимания+'\n _'+up10f12+'_ \
        \n\n7) '+Охотничьясобака+'\n _'+up10f12+'_ \n\n8) '+Обратныеотжиманияотстула+'\n _'+up10f12+'_ \n\n9) '+Велосипед+'\n _'+up10f12+'_ \n\n10) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'подкачаться' and placing == 'дома' and time == '1 раз': #2.3#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time5+'_ \n\n3) '+Берпи+'\n _'+up8f10+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up8f10+'_ \n\n5) '+Приседания+'\n _'+up8f10+'_ \n\n6) '+Отжимания+'\n _'+up8f10+'_ \
        \n\n7) '+Охотничьясобака+'\n _'+up8f10+'_ \n\n8) '+Обратныеотжиманияотстула+'\n _'+up8f10+'_ \n\n9) '+Велосипед+'\n _'+up8f10+'_ \n\n10) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

############################################################################################################################

    elif sex == 'парень' and aim == 'подсушиться' and placing == 'в воркаут зоне' and time == '1 раз': #3.1#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Берпи+'\n _'+up15f20+'_ \
        \n\n4) '+Подтягивание+'\n _'+up15f20+'_ \n\n5) '+Подтягиванияобратнымхватом+'\n _'+up15f20+'_ \n\n6) '+Отжимания+'\n _'+up15f20+'_ \
        \n\n7) '+Отжиманиянабрусьях+'\n _'+up15f20+'_ \n\n8) '+Приседаниясвыпрыгиванием+'\n _'+up15f20+'_ \n\n9) '+Скручиваниянаскамье+'\n _'+up15f20+'_ \n\n10) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'держать форму' and placing == 'в воркаут зоне' and time == '1 раз': #3.2#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time10+'_ \n\n3) '+Берпи+'\n _'+up10f12+'_ \
        \n\n4) '+Подтягивание+'\n _'+up10f12+'_ \n\n5) '+Подтягиванияобратнымхватом+'\n _'+up10f12+'_ \n\n6) '+Отжимания+'\n _'+up10f12+'_ \
        \n\n7) '+Отжиманиянабрусьях+'\n _'+up10f12+'_ \n\n8) '+Приседаниясвыпрыгиванием+'\n _'+up10f12+'_ \n\n9) '+Скручиваниянаскамье+'\n _'+up10f12+'_ \n\n10) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'подкачаться' and placing == 'в воркаут зоне' and time == '1 раз': #3.3#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time5+'_ \n\n3) '+Берпи+'\n _'+up8f10+'_ \
        \n\n4) '+Подтягивание+'\n _'+up8f10+'_ \n\n5) '+Подтягиванияобратнымхватом+'\n _'+up8f10+'_ \n\n6) '+Отжимания+'\n _'+up8f10+'_ \
        \n\n7) '+Отжиманиянабрусьях+'\n _'+up8f10+'_ \n\n8) '+Приседаниясвыпрыгиванием+'\n _'+up8f10+'_ \n\n9) '+Скручиваниянаскамье+'\n _'+up8f10+'_ \n\n10) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

############################################################################################################################

    elif sex == 'парень' and aim == 'подсушиться' and placing == 'в зале' and time == '2 раза': #4.1 ДВА ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time20+'_ \n\n3) '+Скручиваниянаскамье+'\n _'+up15f20+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up15f20+'_ \n\n5) '+Становаятяга+'\n _'+up15f20+'_ \n\n6) '+Приседаниясоштангой+'\n _'+up15f20+'_ \
        \n\n7) '+Тягаверхнегоблока+'\n _'+up15f20+'_ \n\n8) '+Подтягиванияобратнымхватом+'\n _'+up15f20+'_ \n\n9) '+ТягаТгрифа+'\n _'+up15f20+'_ \n\n10) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Эллипсоид+'\n _'+time20+'_ \n\n3) '+Скручиваниянаскамье+'\n _'+up15f20+'_ \
        \n\n4) '+Жимлежа+'\n _'+up15f20+'_ \n\n5) '+Сведениеруквбабочке+'\n _'+up15f20+'_ \n\n6) '+Армейскийжимвтренажере+'\n _'+up15f20+'_ \
        \n\n7) '+Французскийжим+'\n _'+up15f20+'_ \n\n8) '+Сгибаниеруксгантелямисоступинацией+'\n _'+up15f20+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'держать форму' and placing == 'в зале' and time == '2 раза': #4.2 ДВА ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time10+'_ \n\n3) '+Скручиваниянаскамье+'\n _'+up10f12+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up10f12+'_ \n\n5) '+Становаятяга+'\n _'+up10f12+'_ \n\n6) '+Приседаниясоштангой+'\n _'+up10f12+'_ \
        \n\n7) '+Тягаверхнегоблока+'\n _'+up10f12+'_ \n\n8) '+Подтягиванияобратнымхватом+'\n _'+up10f12+'_ \n\n9) '+ТягаТгрифа+'\n _'+up10f12+'_ \n\n10) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Эллипсоид+'\n _'+time10+'_ \n\n3) '+Скручиваниянаскамье+'\n _'+up10f12+'_ \
        \n\n4) '+Жимлежа+'\n _'+up10f12+'_ \n\n5) '+Сведениеруквбабочке+'\n _'+up10f12+'_ \n\n6) '+Армейскийжимвтренажере+'\n _'+up10f12+'_ \
        \n\n7) '+Французскийжим+'\n _'+up10f12+'_ \n\n8) '+Сгибаниеруксгантелямисоступинацией+'\n _'+up10f12+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'подкачаться' and placing == 'в зале' and time == '2 раза': #4.3 ДВА ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time5+'_ \n\n3) '+Скручиваниянаскамье+'\n _'+up8f10+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up8f10+'_ \n\n5) '+Становаятяга+'\n _'+up8f10+'_ \n\n6) '+Приседаниясоштангой+'\n _'+up8f10+'_ \
        \n\n7) '+Тягаверхнегоблока+'\n _'+up8f10+'_ \n\n8) '+Подтягиванияобратнымхватом+'\n _'+up8f10+'_ \n\n9) '+ТягаТгрифа+'\n _'+up8f10+'_ \n\n10) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Эллипсоид+'\n _'+time5+'_ \n\n3) '+Скручиваниянаскамье+'\n _'+up8f10+'_ \
        \n\n4) '+Жимлежа+'\n _'+up8f10+'_ \n\n5) '+Сведениеруквбабочке+'\n _'+up8f10+'_ \n\n6) '+Армейскийжимвтренажере+'\n _'+up8f10+'_ \
        \n\n7) '+Французскийжим+'\n _'+up8f10+'_ \n\n8) '+Сгибаниеруксгантелямисоступинацией+'\n _'+up8f10+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

############################################################################################################################

    elif sex == 'парень' and aim == 'подсушиться' and placing == 'дома' and time == '2 раза': #5.1 ДВА ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time20+'_ \n\n3) '+Скручиваниянаскамье+'\n _'+up15f20+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up15f20+'_ \n\n5) '+Охотничьясобака+'\n _'+up15f20+'_ \n\n6) '+Подъемынаноскисвозвышением+'\n _'+up15f20+'_ \
        \n\n7) '+Приседаниясвыпрыгиванием+'\n _'+up15f20+'_ \n\n8) '+Выпадывперед+'\n _'+up15f20+'_ \n\n9) '+Стульчик+'\n _'+up15f20+'_ \n\n10) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time20+'_ \n\n3) '+Книжка+'\n _'+up15f20+'_ \
        \n\n4) '+Отжимания+'\n _'+up15f20+'_ \n\n5) '+Треугольныеотжимания+'\n _'+up15f20+'_ \n\n6) '+Обратныеотжиманияотстула+'\n _'+up15f20+'_ \
        \n\n7) '+Отжиманияуголком+'\n _'+up15f20+'_ \n\n8) '+Поднятиетяжестипередсобой+'\n _'+up15f20+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'держать форму' and placing == 'дома' and time == '2 раза': #5.2 ДВА ДНЯ
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time10+'_ \n\n3) '+Скручиваниянаскамье+'\n _'+up10f12+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up10f12+'_ \n\n5) '+Охотничьясобака+'\n _'+up10f12+'_ \n\n6) '+Подъемынаноскисвозвышением+'\n _'+up10f12+'_ \
        \n\n7) '+Приседаниясвыпрыгиванием+'\n _'+up10f12+'_ \n\n8) '+Выпадывперед+'\n _'+up10f12+'_ \n\n9) '+Стульчик+'\n _'+up10f12+'_ \n\n10) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time10+'_ \n\n3) '+Книжка+'\n _'+up10f12+'_ \
        \n\n4) '+Отжимания+'\n _'+up10f12+'_ \n\n5) '+Треугольныеотжимания+'\n _'+up10f12+'_ \n\n6) '+Обратныеотжиманияотстула+'\n _'+up10f12+'_ \
        \n\n7) '+Отжиманияуголком+'\n _'+up10f12+'_ \n\n8) '+Поднятиетяжестипередсобой+'\n _'+up10f12+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'подкачаться' and placing == 'дома' and time == '2 раза': #5.3 ДВА ДНЯ
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time5+'_ \n\n3) '+Скручиваниянаскамье+'\n _'+up8f10+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up8f10+'_ \n\n5) '+Охотничьясобака+'\n _'+up8f10+'_ \n\n6) '+Подъемынаноскисвозвышением+'\n _'+up8f10+'_ \
        \n\n7) '+Приседаниясвыпрыгиванием+'\n _'+up8f10+'_ \n\n8) '+Выпадывперед+'\n _'+up8f10+'_ \n\n9) '+Стульчик+'\n _'+up8f10+'_ \n\n10) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time5+'_ \n\n3) '+Книжка+'\n _'+up8f10+'_ \
        \n\n4) '+Отжимания+'\n _'+up8f10+'_ \n\n5) '+Треугольныеотжимания+'\n _'+up8f10+'_ \n\n6) '+Обратныеотжиманияотстула+'\n _'+up8f10+'_ \
        \n\n7) '+Отжиманияуголком+'\n _'+up8f10+'_ \n\n8) '+Поднятиетяжестипередсобой+'\n _'+up8f10+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

#########################################################################################################################

    elif sex == 'парень' and aim == 'подсушиться' and placing == 'в воркаут зоне' and time == '2 раза': #6.1 ДВА ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Подтягивание+'\n _'+up15f20+'_ \
        \n\n4) '+Подтягиванияобратнымхватом+'\n _'+up15f20+'_ \n\n5) '+Горизонтальныеподтягивания+'\n _'+up15f20+'_ \n\n6) '+Выпадывперед+'\n _'+up15f20+'_ \
        \n\n7) '+Стульчик+'\n _'+up15f20+'_ \n\n8) '+Приседаниясвыпрыгиванием+'\n _'+up15f20+'_ \n\n9) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Берпи+'\n _'+up15f20+'_ \
        \n\n4) '+Книжка+'\n _'+up15f20+'_ \n\n5) '+Отжимания+'\n _'+up15f20+'_ \n\n6) '+Отжиманиянабрусьях+'\n _'+up15f20+'_ \
        \n\n7) '+Треугольныеотжимания+'\n _'+up15f20+'_ \n\n8) '+Отжиманияуголком+'\n _'+up15f20+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'держать форму' and placing == 'в воркаут зоне' and time == '2 раза': #6.2 ДВА ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time10+'_ \n\n3) '+Подтягивание+'\n _'+up10f12+'_ \
        \n\n4) '+Подтягиванияобратнымхватом+'\n _'+up10f12+'_ \n\n5) '+Горизонтальныеподтягивания+'\n _'+up10f12+'_ \n\n6) '+Выпадывперед+'\n _'+up10f12+'_ \
        \n\n7) '+Стульчик+'\n _'+up10f12+'_ \n\n8) '+Приседаниясвыпрыгиванием+'\n _'+up10f12+'_ \n\n9) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Берпи+'\n _'+up10f12+'_ \
        \n\n4) '+Книжка+'\n _'+up10f12+'_ \n\n5) '+Отжимания+'\n _'+up10f12+'_ \n\n6) '+Отжиманиянабрусьях+'\n _'+up10f12+'_ \
        \n\n7) '+Треугольныеотжимания+'\n _'+up10f12+'_ \n\n8) '+Отжиманияуголком+'\n _'+up10f12+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'подкачаться' and placing == 'в воркаут зоне' and time == '2 раза': #6.3 ДВА ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time5+'_ \n\n3) '+Подтягивание+'\n _'+up8f10+'_ \
        \n\n4) '+Подтягиванияобратнымхватом+'\n _'+up8f10+'_ \n\n5) '+Горизонтальныеподтягивания+'\n _'+up8f10+'_ \n\n6) '+Выпадывперед+'\n _'+up8f10+'_ \
        \n\n7) '+Стульчик+'\n _'+up8f10+'_ \n\n8) '+Приседаниясвыпрыгиванием+'\n _'+up8f10+'_ \n\n9) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time5+'_ \n\n3) '+Берпи+'\n _'+up8f10+'_ \
        \n\n4) '+Книжка+'\n _'+up8f10+'_ \n\n5) '+Отжимания+'\n _'+up8f10+'_ \n\n6) '+Отжиманиянабрусьях+'\n _'+up8f10+'_ \
        \n\n7) '+Треугольныеотжимания+'\n _'+up8f10+'_ \n\n8) '+Отжиманияуголком+'\n _'+up8f10+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

#########################################################################################################################

    elif sex == 'парень' and aim == 'подсушиться' and placing == 'в зале' and time == '3 раза': #7.1 ТРИ ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time20+'_ \n\n3) '+Жимлежа+'\n _'+up15f20+'_ \
        \n\n4) '+Жимлежаузкимхватом+'\n _'+up15f20+'_ \n\n5) '+Французскийжим+'\n _'+up15f20+'_ \n\n6) '+Армейскийжимвтренажере+'\n _'+up15f20+'_ \
        \n\n7) '+Тягаштангикгрудистоя+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time20+'_ \n\n3) '+Становаятяга+'\n _'+up15f20+'_ \
        \n\n4) '+Тягаверхнегоблока+'\n _'+up15f20+'_ \n\n5) '+ТягаТгрифа+'\n _'+up15f20+'_ \n\n6) '+Сгибаниеруксоштангой+'\n _'+up15f20+'_ \
        \n\n7) '+Сгибаниеруксгантелямисоступинацией+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time20+'_ \n\n3) '+Приседаниясоштангой+'\n _'+up15f20+'_ \
        \n\n4) '+Подъемынаноскисвозвышением+'\n _'+up15f20+'_ \n\n5) '+Разгибаниеногвтренажере+'\n _'+up15f20+'_ \n\n6) '+Cгибаниеногвтренажере+'\n _'+up15f20+'_ \
        \n\n7) '+Скручиваниенаскамье+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'держать форму' and placing == 'в зале' and time == '3 раза': #7.2 ТРИ ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time10+'_ \n\n3) '+Жимлежа+'\n _'+up10f12+'_ \
        \n\n4) '+Жимлежаузкимхватом+'\n _'+up10f12+'_ \n\n5) '+Французскийжим+'\n _'+up10f12+'_ \n\n6) '+Армейскийжимвтренажере+'\n _'+up10f12+'_ \
        \n\n7) '+Тягаштангикгрудистоя+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time10+'_ \n\n3) '+Становаятяга+'\n _'+up10f12+'_ \
        \n\n4) '+Тягаверхнегоблока+'\n _'+up10f12+'_ \n\n5) '+ТягаТгрифа+'\n _'+up10f12+'_ \n\n6) '+Сгибаниеруксоштангой+'\n _'+up10f12+'_ \
        \n\n7) '+Сгибаниеруксгантелямисоступинацией+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time10+'_ \n\n3) '+Приседаниясоштангой+'\n _'+up10f12+'_ \
        \n\n4) '+Подъемынаноскисвозвышением+'\n _'+up10f12+'_ \n\n5) '+Разгибаниеногвтренажере+'\n _'+up10f12+'_ \n\n6) '+Cгибаниеногвтренажере+'\n _'+up10f12+'_ \
        \n\n7) '+Скручиваниенаскамье+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'подкачаться' and placing == 'в зале' and time == '3 раза': #7.3 ТРИ ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time5+'_ \n\n3) '+Жимлежа+'\n _'+up8f10+'_ \
        \n\n4) '+Жимлежаузкимхватом+'\n _'+up8f10+'_ \n\n5) '+Французскийжим+'\n _'+up8f10+'_ \n\n6) '+Армейскийжимвтренажере+'\n _'+up8f10+'_ \
        \n\n7) '+Тягаштангикгрудистоя+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time5+'_ \n\n3) '+Становаятяга+'\n _'+up8f10+'_ \
        \n\n4) '+Тягаверхнегоблока+'\n _'+up8f10+'_ \n\n5) '+ТягаТгрифа+'\n _'+up8f10+'_ \n\n6) '+Сгибаниеруксоштангой+'\n _'+up8f10+'_ \
        \n\n7) '+Сгибаниеруксгантелямисоступинацией+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time5+'_ \n\n3) '+Приседаниясоштангой+'\n _'+up8f10+'_ \
        \n\n4) '+Подъемынаноскисвозвышением+'\n _'+up8f10+'_ \n\n5) '+Разгибаниеногвтренажере+'\n _'+up8f10+'_ \n\n6) '+Cгибаниеногвтренажере+'\n _'+up8f10+'_ \
        \n\n7) '+Скручиваниенаскамье+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

#########################################################################################################################

    elif sex == 'парень' and aim == 'подсушиться' and placing == 'дома' and time == '3 раза': #8.1 ТРИ ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time20+'_ \n\n3) '+Отжимания+'\n _'+up15f20+'_ \
        \n\n4) '+Треугольныеотжимания+'\n _'+up15f20+'_ \n\n5) '+Обратныеотжиманияотстула+'\n _'+up15f20+'_ \n\n6) '+Отжиманияуголком+'\n _'+up15f20+'_ \
        \n\n7) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time20+'_ \n\n3) '+Берпи+'\n _'+up15f20+'_ \
        \n\n4) '+Скручиваниянаскамье+'\n _'+up15f20+'_ \n\n5) '+Велосипед+'\n _'+up15f20+'_ \n\n6) '+Гиперэкстензия+'\n _'+up15f20+'_ \
        \n\n7) '+Охотничьясобака+'\n _'+up15f20+'_ \n\n8) '+Уголок+'\n _'+up15f20+'_ \n\n9) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time20+'_ \n\n3) '+Приседания+'\n _'+up15f20+'_ \
        \n\n4) '+Приседаниясвыпрыгиванием+'\n _'+up15f20+'_ \n\n5) '+Стульчик+'\n _'+up15f20+'_ \n\n6) '+Выпадывперед+'\n _'+up15f20+'_ \
        \n\n7) '+Подъемынаноскисвозвышением+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'держать форму' and placing == 'дома' and time == '3 раза': #8.2 ТРИ ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time10+'_ \n\n3) '+Отжимания+'\n _'+up10f12+'_ \
        \n\n4) '+Треугольныеотжимания+'\n _'+up10f12+'_ \n\n5) '+Обратныеотжиманияотстула+'\n _'+up10f12+'_ \n\n6) '+Отжиманияуголком+'\n _'+up10f12+'_ \
        \n\n7) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time10+'_ \n\n3) '+Берпи+'\n _'+up10f12+'_ \
        \n\n4) '+Скручиваниянаскамье+'\n _'+up10f12+'_ \n\n5) '+Велосипед+'\n _'+up10f12+'_ \n\n6) '+Гиперэкстензия+'\n _'+up10f12+'_ \
        \n\n7) '+Охотничьясобака+'\n _'+up10f12+'_ \n\n8) '+Уголок+'\n _'+up10f12+'_ \n\n9) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time10+'_ \n\n3) '+Приседания+'\n _'+up10f12+'_ \
        \n\n4) '+Приседаниясвыпрыгиванием+'\n _'+up10f12+'_ \n\n5) '+Стульчик+'\n _'+up10f12+'_ \n\n6) '+Выпадывперед+'\n _'+up10f12+'_ \
        \n\n7) '+Подъемынаноскисвозвышением+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'подкачаться' and placing == 'дома' and time == '3 раза': #8.3 ТРИ ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time5+'_ \n\n3) '+Отжимания+'\n _'+up8f10+'_ \
        \n\n4) '+Треугольныеотжимания+'\n _'+up8f10+'_ \n\n5) '+Обратныеотжиманияотстула+'\n _'+up8f10+'_ \n\n6) '+Отжиманияуголком+'\n _'+up8f10+'_ \
        \n\n7) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time5+'_ \n\n3) '+Берпи+'\n _'+up8f10+'_ \
        \n\n4) '+Скручиваниянаскамье+'\n _'+up8f10+'_ \n\n5) '+Велосипед+'\n _'+up8f10+'_ \n\n6) '+Гиперэкстензия+'\n _'+up8f10+'_ \
        \n\n7) '+Охотничьясобака+'\n _'+up8f10+'_ \n\n8) '+Уголок+'\n _'+up8f10+'_ \n\n9) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time5+'_ \n\n3) '+Приседания+'\n _'+up8f10+'_ \
        \n\n4) '+Приседаниясвыпрыгиванием+'\n _'+up8f10+'_ \n\n5) '+Стульчик+'\n _'+up8f10+'_ \n\n6) '+Выпадывперед+'\n _'+up8f10+'_ \
        \n\n7) '+Подъемынаноскисвозвышением+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

#########################################################################################################################

    elif sex == 'парень' and aim == 'подсушиться' and placing == 'в воркаут зоне' and time == '3 раза': #9.1 ТРИ ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Отжимания+'\n _'+up15f20+'_ \
        \n\n4) '+Треугольныеотжимания+'\n _'+up15f20+'_ \n\n5) '+Отжиманиянабрусьях+'\n _'+up15f20+'_ \n\n6) '+Отжиманияуголком+'\n _'+up15f20+'_ \
        \n\n7) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Подтягивание+'\n _'+up15f20+'_ \
        \n\n4) '+Подтягиванияобратнымхватом+'\n _'+up15f20+'_ \n\n5) '+Горизонтальныеподтягивания+'\n _'+up15f20+'_ \n\n6) '+Скручиваниенаскамье+'\n _'+up15f20+'_ \
        \n\n7) '+Подъемногввисе+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Приседания+'\n _'+up15f20+'_ \
        \n\n4) '+Приседаниясвыпрыгиванием+'\n _'+up15f20+'_ \n\n5) '+Стульчик+'\n _'+up15f20+'_ \n\n6) '+Выпадывперед+'\n _'+up15f20+'_ \
        \n\n7) '+Подъемынаноскисвозвышением+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'держать форму' and placing == 'в воркаут зоне' and time == '3 раза': #9.2 ТРИ ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time10+'_ \n\n3) '+Отжимания+'\n _'+up10f12+'_ \
        \n\n4) '+Треугольныеотжимания+'\n _'+up10f12+'_ \n\n5) '+Отжиманиянабрусьях+'\n _'+up10f12+'_ \n\n6) '+Отжиманияуголком+'\n _'+up10f12+'_ \
        \n\n7) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time10+'_ \n\n3) '+Подтягивание+'\n _'+up10f12+'_ \
        \n\n4) '+Подтягиванияобратнымхватом+'\n _'+up10f12+'_ \n\n5) '+Горизонтальныеподтягивания+'\n _'+up10f12+'_ \n\n6) '+Скручиваниенаскамье+'\n _'+up10f12+'_ \
        \n\n7) '+Охотничьясобака+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time10+'_ \n\n3) '+Приседания+'\n _'+up10f12+'_ \
        \n\n4) '+Приседаниясвыпрыгиванием+'\n _'+up10f12+'_ \n\n5) '+Стульчик+'\n _'+up10f12+'_ \n\n6) '+Выпадывперед+'\n _'+up10f12+'_ \
        \n\n7) '+Подъемногввисе+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'парень' and aim == 'подкачаться' and placing == 'в воркаут зоне' and time == '3 раза': #9.3 ТРИ ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time5+'_ \n\n3) '+Отжимания+'\n _'+up8f10+'_ \
        \n\n4) '+Треугольныеотжимания+'\n _'+up8f10+'_ \n\n5) '+Отжиманиянабрусьях+'\n _'+up8f10+'_ \n\n6) '+Отжиманияуголком+'\n _'+up8f10+'_ \
        \n\n7) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time5+'_ \n\n3) '+Подтягивание+'\n _'+up8f10+'_ \
        \n\n4) '+Подтягиванияобратнымхватом+'\n _'+up8f10+'_ \n\n5) '+Горизонтальныеподтягивания+'\n _'+up8f10+'_ \n\n6) '+Скручиваниенаскамье+'\n _'+up8f10+'_ \
        \n\n7) '+Охотничьясобака+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time5+'_ \n\n3) '+Приседания+'\n _'+up8f10+'_ \
        \n\n4) '+Приседаниясвыпрыгиванием+'\n _'+up8f10+'_ \n\n5) '+Стульчик+'\n _'+up8f10+'_ \n\n6) '+Выпадывперед+'\n _'+up8f10+'_ \
        \n\n7) '+Подъемногввисе+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')




#__________________ВЫВОД ТРЕНИРОВКИ__________________#ДЕВУШКИ




    elif sex == 'девушка' and aim == 'подсушиться' and placing == 'в зале' and time == '1 раз': #10.1#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time20+'_ \n\n3) '+Гиперэкстензия+'\n _'+up15f20+'_ \
        \n\n4) '+Выпадысгантелями+'\n _'+up15f20+'_ \n\n5) '+ЯгодичныймоствСмите+'\n _'+up15f20+'_ \n\n6) '+Подтягиваниявгравитронеобратнымхватом+'\n _'+up15f20+'_ \
        \n\n7) '+Тягаверхнегоблока+'\n _'+up15f20+'_ \n\n8) '+Обратныеотжиманияотстула+'\n _'+up15f20+'_ \n\n9) '+Велосипед+'\n _'+up15f20+'_ \n\n10) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'держать форму' and placing == 'в зале' and time == '1 раз': #10.2#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time10+'_ \n\n3) '+Гиперэкстензия+'\n _'+up10f12+'_ \
        \n\n4) '+Выпадысгантелями+'\n _'+up10f12+'_ \n\n5) '+ЯгодичныймоствСмите+'\n _'+up10f12+'_ \n\n6) '+Подтягиваниявгравитронеобратнымхватом+'\n _'+up10f12+'_ \
        \n\n7) '+Тягаверхнегоблока+'\n _'+up10f12+'_ \n\n8) '+Обратныеотжиманияотстула+'\n _'+up10f12+'_ \n\n9) '+Велосипед+'\n _'+up10f12+'_ \n\n10) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'подкачаться' and placing == 'в зале' and time == '1 раз': #10.3#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time5+'_ \n\n3) '+Гиперэкстензия+'\n _'+up8f10+'_ \
        \n\n4) '+Выпадысгантелями+'\n _'+up8f10+'_ \n\n5) '+ЯгодичныймоствСмите+'\n _'+up8f10+'_ \n\n6) '+Подтягиваниявгравитронеобратнымхватом+'\n _'+up8f10+'_ \
        \n\n7) '+Тягаверхнегоблока+'\n _'+up8f10+'_ \n\n8) '+Обратныеотжиманияотстула+'\n _'+up8f10+'_ \n\n9) '+Велосипед+'\n _'+up8f10+'_ \n\n10) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

#########################################################################################################################

    elif sex == 'девушка' and aim == 'подсушиться' and placing == 'дома' and time == '1 раз': #11.1#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time20+'_ \n\n3) '+Берпи+'\n _'+up15f20+'_ \
        \n\n4) '+Приседания+'\n _'+up15f20+'_ \n\n5) '+Выпадывперед+'\n _'+up15f20+'_ \n\n6) '+Ягодичныймост+'\n _'+up15f20+'_ \
        \n\n7) '+Велосипед+'\n _'+up15f20+'_ \n\n8) '+Охотничьясобака+'\n _'+up15f20+'_ \n\n9) '+Обратныеотжиманияотстула+'\n _'+up15f20+'_ \n\n10) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'держать форму' and placing == 'дома' and time == '1 раз': #11.2#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time10+'_ \n\n3) '+Берпи+'\n _'+up10f12+'_ \
        \n\n4) '+Приседания+'\n _'+up10f12+'_ \n\n5) '+Выпадывперед+'\n _'+up10f12+'_ \n\n6) '+Ягодичныймост+'\n _'+up10f12+'_ \
        \n\n7) '+Велосипед+'\n _'+up10f12+'_ \n\n8) '+Охотничьясобака+'\n _'+up10f12+'_ \n\n9) '+Обратныеотжиманияотстула+'\n _'+up10f12+'_ \n\n10) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'подкачаться' and placing == 'дома' and time == '1 раз': #11.3#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time5+'_ \n\n3) '+Берпи+'\n _'+up8f10+'_ \
        \n\n4) '+Приседания+'\n _'+up8f10+'_ \n\n5) '+Выпадывперед+'\n _'+up8f10+'_ \n\n6) '+Ягодичныймост+'\n _'+up8f10+'_ \
        \n\n7) '+Велосипед+'\n _'+up8f10+'_ \n\n8) '+Охотничьясобака+'\n _'+up8f10+'_ \n\n9) '+Обратныеотжиманияотстула+'\n _'+up8f10+'_ \n\n10) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

#########################################################################################################################

    elif sex == 'девушка' and aim == 'подсушиться' and placing == 'в воркаут зоне' and time == '1 раз': #12.1#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Берпи+'\n _'+up15f20+'_ \
        \n\n4) '+Приседания+'\n _'+up15f20+'_ \n\n5) '+Выпадывперед+'\n _'+up15f20+'_ \n\n6) '+Скручиваниенаскамье+'\n _'+up15f20+'_ \
        \n\n7) '+Подъемногввисе+'\n _'+up15f20+'_ \n\n8) '+Обратныеотжиманияотстула+'\n _'+up15f20+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'держать форму' and placing == 'в воркаут зоне' and time == '1 раз': #12.2#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time10+'_ \n\n3) '+Берпи+'\n _'+up10f12+'_ \
        \n\n4) '+Приседания+'\n _'+up10f12+'_ \n\n5) '+Выпадывперед+'\n _'+up10f12+'_ \n\n6) '+Скручиваниенаскамье+'\n _'+up10f12+'_ \
        \n\n7) '+Подъемногввисе+'\n _'+up10f12+'_ \n\n8) '+Обратныеотжиманияотстула+'\n _'+up10f12+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'подкачаться' and placing == 'в воркаут зоне' and time == '1 раз': #12.3#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time5+'_ \n\n3) '+Берпи+'\n _'+up8f10+'_ \
        \n\n4) '+Приседания+'\n _'+up8f10+'_ \n\n5) '+Выпадывперед+'\n _'+up8f10+'_ \n\n6) '+Скручиваниенаскамье+'\n _'+up8f10+'_ \
        \n\n7) '+Подъемногввисе+'\n _'+up8f10+'_ \n\n8) '+Обратныеотжиманияотстула+'\n _'+up8f10+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

#########################################################################################################################

    elif sex == 'девушка' and aim == 'подсушиться' and placing == 'в зале' and time == '2 раза': #13.1#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time20+'_ \n\n3) '+Гиперэкстензия+'\n _'+up15f20+'_ \
        \n\n4) '+Подтягиваниявгравитронеобратнымхватом+'\n _'+up15f20+'_ \n\n5) '+Тягаверхнегоблока+'\n _'+up15f20+'_ \n\n6) '+Тягаштангикгрудистоя+'\n _'+up15f20+'_ \
        \n\n7) '+Обратныеотжиманияотстула+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Эллипсоид+'\n _'+time20+'_ \n\n3) '+Выпадысгантелями+'\n _'+up15f20+'_ \
        \n\n4) '+ЯгодичныймоствСмите+'\n _'+up15f20+'_ \n\n5) '+Приседаниясоштангой+'\n _'+up15f20+'_ \n\n6) '+Жимплатформы+'\n _'+up15f20+'_ \
        \n\n7) '+Скручиваниянаскамье+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'держать форму' and placing == 'в зале' and time == '2 раза': #13.2#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time10+'_ \n\n3) '+Гиперэкстензия+'\n _'+up10f12+'_ \
        \n\n4) '+Подтягиваниявгравитронеобратнымхватом+'\n _'+up10f12+'_ \n\n5) '+Тягаверхнегоблока+'\n _'+up10f12+'_ \n\n6) '+Тягаштангикгрудистоя+'\n _'+up10f12+'_ \
        \n\n7) '+Обратныеотжиманияотстула+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Эллипсоид+'\n _'+time10+'_ \n\n3) '+Выпадысгантелями+'\n _'+up10f12+'_ \
        \n\n4) '+ЯгодичныймоствСмите+'\n _'+up10f12+'_ \n\n5) '+Приседаниясоштангой+'\n _'+up10f12+'_ \n\n6) '+Жимплатформы+'\n _'+up10f12+'_ \
        \n\n7) '+Скручиваниянаскамье+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'подкачаться' and placing == 'в зале' and time == '2 раза': #13.3#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time5+'_ \n\n3) '+Гиперэкстензия+'\n _'+up8f10+'_ \
        \n\n4) '+Подтягиваниявгравитронеобратнымхватом+'\n _'+up8f10+'_ \n\n5) '+Тягаверхнегоблока+'\n _'+up8f10+'_ \n\n6) '+Тягаштангикгрудистоя+'\n _'+up8f10+'_ \
        \n\n7) '+Обратныеотжиманияотстула+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Эллипсоид+'\n _'+time5+'_ \n\n3) '+Выпадысгантелями+'\n _'+up8f10+'_ \
        \n\n4) '+ЯгодичныймоствСмите+'\n _'+up8f10+'_ \n\n5) '+Приседаниясоштангой+'\n _'+up8f10+'_ \n\n6) '+Жимплатформы+'\n _'+up8f10+'_ \
        \n\n7) '+Скручиваниянаскамье+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

############################################################################################################################

    elif sex == 'девушка' and aim == 'подсушиться' and placing == 'дома' and time == '2 раза': #14.1#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time20+'_ \n\n3) '+Берпи+'\n _'+up15f20+'_ \
        \n\n4) '+Охотничьясобака+'\n _'+up15f20+'_ \n\n5) '+Отжимания+'\n _'+up15f20+'_ \n\n6) '+Обратныеотжиманияотстула+'\n _'+up15f20+'_ \
        \n\n7) '+Уголок+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time20+'_ \n\n3) '+Приседания+'\n _'+up15f20+'_ \
        \n\n4) '+Выпадывперед+'\n _'+up15f20+'_ \n\n5) '+Ягодичныймост+'\n _'+up15f20+'_ \n\n6) '+Велосипед+'\n _'+up15f20+'_ \
        \n\n7) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'держать форму' and placing == 'дома' and time == '2 раза': #14.2#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time10+'_ \n\n3) '+Берпи+'\n _'+up10f12+'_ \
        \n\n4) '+Охотничьясобака+'\n _'+up10f12+'_ \n\n5) '+Отжимания+'\n _'+up10f12+'_ \n\n6) '+Обратныеотжиманияотстула+'\n _'+up10f12+'_ \
        \n\n7) '+Уголок+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time10+'_ \n\n3) '+Приседания+'\n _'+up10f12+'_ \
        \n\n4) '+Выпадывперед+'\n _'+up10f12+'_ \n\n5) '+Ягодичныймост+'\n _'+up10f12+'_ \n\n6) '+Велосипед+'\n _'+up10f12+'_ \
        \n\n7) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'подкачаться' and placing == 'дома' and time == '2 раза': #14.3#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time5+'_ \n\n3) '+Берпи+'\n _'+up8f10+'_ \
        \n\n4) '+Охотничьясобака+'\n _'+up8f10+'_ \n\n5) '+Отжимания+'\n _'+up8f10+'_ \n\n6) '+Обратныеотжиманияотстула+'\n _'+up8f10+'_ \
        \n\n7) '+Уголок+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time5+'_ \n\n3) '+Приседания+'\n _'+up8f10+'_ \
        \n\n4) '+Выпадывперед+'\n _'+up8f10+'_ \n\n5) '+Ягодичныймост+'\n _'+up8f10+'_ \n\n6) '+Велосипед+'\n _'+up8f10+'_ \
        \n\n7) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

#########################################################################################################################

    elif sex == 'девушка' and aim == 'подсушиться' and placing == 'в воркаут зоне' and time == '2 раза': #15.1#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Подтягивание+'\n _'+up15f20+'_ \
        \n\n4) '+Отжимания+'\n _'+up15f20+'_ \n\n5) '+Обратныеотжиманияотстула+'\n _'+up15f20+'_ \n\n6) '+Подъемногввисе+'\n _'+up15f20+'_ \
        \n\n7) '+Уголок+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Подтягивание+'\n _'+up15f20+'_ \
        \n\n4) '+Приседания+'\n _'+up15f20+'_ \n\n5) '+Выпадывперед+'\n _'+up15f20+'_ \n\n6) '+Скручиваниянаскамье+'\n _'+up15f20+'_ \
        \n\n7) '+Велосипед+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'держать форму' and placing == 'в воркаут зоне' and time == '2 раза': #15.2#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time10+'_ \n\n3) '+Подтягивание+'\n _'+up10f12+'_ \
        \n\n4) '+Отжимания+'\n _'+up10f12+'_ \n\n5) '+Обратныеотжиманияотстула+'\n _'+up10f12+'_ \n\n6) '+Подъемногввисе+'\n _'+up10f12+'_ \
        \n\n7) '+Уголок+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Подтягивание+'\n _'+up10f12+'_ \
        \n\n4) '+Приседания+'\n _'+up10f12+'_ \n\n5) '+Выпадывперед+'\n _'+up10f12+'_ \n\n6) '+Скручиваниянаскамье+'\n _'+up10f12+'_ \
        \n\n7) '+Велосипед+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'подкачаться' and placing == 'в воркаут зоне' and time == '2 раза': #15.3#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time5+'_ \n\n3) '+Подтягивание+'\n _'+up8f10+'_ \
        \n\n4) '+Отжимания+'\n _'+up8f10+'_ \n\n5) '+Обратныеотжиманияотстула+'\n _'+up8f10+'_ \n\n6) '+Подъемногввисе+'\n _'+up8f10+'_ \
        \n\n7) '+Уголок+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time5+'_ \n\n3) '+Подтягивание+'\n _'+up8f10+'_ \
        \n\n4) '+Приседания+'\n _'+up8f10+'_ \n\n5) '+Выпадывперед+'\n _'+up8f10+'_ \n\n6) '+Скручиваниянаскамье+'\n _'+up8f10+'_ \
        \n\n7) '+Велосипед+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

#########################################################################################################################

    elif sex == 'девушка' and aim == 'подсушиться' and placing == 'в зале' and time == '3 раза': #16.1#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time20+'_ \n\n3) '+Сведениеруклежа+'\n _'+up15f20+'_ \
        \n\n4) '+Жимвхаммере+'\n _'+up15f20+'_ \n\n5) '+Французскийжим+'\n _'+up15f20+'_ \n\n6) '+Армейскийжимвтренажере+'\n _'+up15f20+'_ \
        \n\n7) '+Тягаштангикгрудистоя+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Велосипед+'\n _'+time20+'_ \n\n3) '+Гиперэкстензия+'\n _'+up15f20+'_ \
        \n\n4) '+Тягаверхнегоблока+'\n _'+up15f20+'_ \n\n5) '+ТягаТгрифа+'\n _'+up15f20+'_ \n\n6) '+Подтягиваниявгравитронеобратнымхватом+'\n _'+up15f20+'_ \
        \n\n7) '+Подъемногввисе+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Велосипед+'\n _'+time20+'_ \n\n3) '+Приседаниясоштангой+'\n _'+up15f20+'_ \
        \n\n4) '+Подъемынаноскисвозвышением+'\n _'+up15f20+'_ \n\n5) '+Разгибаниеногвтренажере+'\n _'+up15f20+'_ \n\n6) '+Cгибаниеногвтренажере+'\n _'+up15f20+'_ \
        \n\n7) '+Скручиваниенаскамье+'\n _'+up15f20+'_ \n\n8) '+ЯгодичныймоствСмите+'\n _'+up15f20+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'держать форму' and placing == 'в зале' and time == '3 раза': #16.2#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time10+'_ \n\n3) '+Сведениеруклежа+'\n _'+up10f12+'_ \
        \n\n4) '+Жимвхаммере+'\n _'+up10f12+'_ \n\n5) '+Французскийжим+'\n _'+up10f12+'_ \n\n6) '+Армейскийжимвтренажере+'\n _'+up10f12+'_ \
        \n\n7) '+Тягаштангикгрудистоя+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Велосипед+'\n _'+time10+'_ \n\n3) '+Гиперэкстензия+'\n _'+up10f12+'_ \
        \n\n4) '+Тягаверхнегоблока+'\n _'+up10f12+'_ \n\n5) '+ТягаТгрифа+'\n _'+up10f12+'_ \n\n6) '+Подтягиваниявгравитронеобратнымхватом+'\n _'+up10f12+'_ \
        \n\n7) '+Подъемногввисе+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Велосипед+'\n _'+time10+'_ \n\n3) '+Приседаниясоштангой+'\n _'+up10f12+'_ \
        \n\n4) '+Подъемынаноскисвозвышением+'\n _'+up10f12+'_ \n\n5) '+Разгибаниеногвтренажере+'\n _'+up10f12+'_ \n\n6) '+Cгибаниеногвтренажере+'\n _'+up10f12+'_ \
        \n\n7) '+Скручиваниенаскамье+'\n _'+up10f12+'_ \n\n8) '+ЯгодичныймоствСмите+'\n _'+up10f12+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'подкачаться' and placing == 'в зале' and time == '3 раза': #16.3#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегнабеговойдорожке+'\n _'+time5+'_ \n\n3) '+Сведениеруклежа+'\n _'+up8f10+'_ \
        \n\n4) '+Жимвхаммере+'\n _'+up8f10+'_ \n\n5) '+Французскийжим+'\n _'+up8f10+'_ \n\n6) '+Армейскийжимвтренажере+'\n _'+up8f10+'_ \
        \n\n7) '+Тягаштангикгрудистоя+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Велосипед+'\n _'+time5+'_ \n\n3) '+Гиперэкстензия+'\n _'+up8f10+'_ \
        \n\n4) '+Тягаверхнегоблока+'\n _'+up8f10+'_ \n\n5) '+ТягаТгрифа+'\n _'+up8f10+'_ \n\n6) '+Подтягиваниявгравитронеобратнымхватом+'\n _'+up8f10+'_ \
        \n\n7) '+Подъемногввисе+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Велосипед+'\n _'+time5+'_ \n\n3) '+Приседаниясоштангой+'\n _'+up8f10+'_ \
        \n\n4) '+Подъемынаноскисвозвышением+'\n _'+up8f10+'_ \n\n5) '+Разгибаниеногвтренажере+'\n _'+up8f10+'_ \n\n6) '+Cгибаниеногвтренажере+'\n _'+up8f10+'_ \
        \n\n7) '+Скручиваниенаскамье+'\n _'+up8f10+'_ \n\n8) '+ЯгодичныймоствСмите+'\n _'+up8f10+'_ \n\n9) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

#########################################################################################################################

    elif sex == 'девушка' and aim == 'подсушиться' and placing == 'дома' and time == '3 раза': #17.1 ТРИ ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time20+'_ \n\n3) '+Берпи+'\n _'+up15f20+'_ \
        \n\n4) '+Отжимания+'\n _'+up15f20+'_ \n\n5) '+Отжиманияуголком+'\n _'+up15f20+'_ \n\n6) '+Обратныеотжиманияотстула+'\n _'+up15f20+'_ \
        \n\n7) '+Уголок+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time20+'_ \n\n3) '+Берпи+'\n _'+up15f20+'_ \
        \n\n4) '+Скручиваниянаскамье+'\n _'+up15f20+'_ \n\n5) '+Велосипед+'\n _'+up15f20+'_ \n\n6) '+Гиперэкстензия+'\n _'+up15f20+'_ \
        \n\n7) '+Охотничьясобака+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time20+'_ \n\n3) '+Приседания+'\n _'+up15f20+'_ \
        \n\n4) '+Приседаниясвыпрыгиванием+'\n _'+up15f20+'_ \n\n5) '+Стульчик+'\n _'+up15f20+'_ \n\n6) '+Выпадывперед+'\n _'+up15f20+'_ \
        \n\n7) '+Подъемынаноскисвозвышением+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'держать форму' and placing == 'дома' and time == '3 раза': #17.2 ТРИ ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time10+'_ \n\n3) '+Берпи+'\n _'+up10f12+'_ \
        \n\n4) '+Отжимания+'\n _'+up10f12+'_ \n\n5) '+Отжиманияуголком+'\n _'+up10f12+'_ \n\n6) '+Обратныеотжиманияотстула+'\n _'+up10f12+'_ \
        \n\n7) '+Уголок+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time10+'_ \n\n3) '+Берпи+'\n _'+up10f12+'_ \
        \n\n4) '+Скручиваниянаскамье+'\n _'+up10f12+'_ \n\n5) '+Велосипед+'\n _'+up10f12+'_ \n\n6) '+Гиперэкстензия+'\n _'+up10f12+'_ \
        \n\n7) '+Охотничьясобака+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time10+'_ \n\n3) '+Приседания+'\n _'+up10f12+'_ \
        \n\n4) '+Приседаниясвыпрыгиванием+'\n _'+up10f12+'_ \n\n5) '+Стульчик+'\n _'+up10f12+'_ \n\n6) '+Выпадывперед+'\n _'+up10f12+'_ \
        \n\n7) '+Подъемынаноскисвозвышением+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'подкачаться' and placing == 'дома' and time == '3 раза': #17.3 ТРИ ДНЯ#
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time5+'_ \n\n3) '+Берпи+'\n _'+up8f10+'_ \
        \n\n4) '+Отжимания+'\n _'+up8f10+'_ \n\n5) '+Отжиманияуголком+'\n _'+up8f10+'_ \n\n6) '+Обратныеотжиманияотстула+'\n _'+up8f10+'_ \
        \n\n7) '+Уголок+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time5+'_ \n\n3) '+Берпи+'\n _'+up8f10+'_ \
        \n\n4) '+Скручиваниянаскамье+'\n _'+up8f10+'_ \n\n5) '+Велосипед+'\n _'+up8f10+'_ \n\n6) '+Гиперэкстензия+'\n _'+up8f10+'_ \
        \n\n7) '+Охотничьясобака+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегполестнице+'\n _'+time5+'_ \n\n3) '+Приседания+'\n _'+up8f10+'_ \
        \n\n4) '+Приседаниясвыпрыгиванием+'\n _'+up8f10+'_ \n\n5) '+Стульчик+'\n _'+up8f10+'_ \n\n6) '+Выпадывперед+'\n _'+up8f10+'_ \
        \n\n7) '+Подъемынаноскисвозвышением+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

#########################################################################################################################

    elif sex == 'девушка' and aim == 'подсушиться' and placing == 'в воркаут зоне' and time == '3 раза': #18.1 ТРИ ДНЯ
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Берпи+'\n _'+up15f20+'_ \
        \n\n4) '+Отжимания+'\n _'+up15f20+'_ \n\n5) '+Отжиманияуголком+'\n _'+up15f20+'_ \n\n6) '+Обратныеотжиманияотстула+'\n _'+up15f20+'_ \
        \n\n7) '+Отжиманияуголком+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Подтягивание+'\n _'+up15f20+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up15f20+'_ \n\n5) '+Охотничьясобака+'\n _'+up15f20+'_ \n\n6) '+Скручиваниянаскамье+'\n _'+up15f20+'_ \
        \n\n7) '+Подъемногввисе+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time20+'_ \n\n3) '+Приседания+'\n _'+up15f20+'_ \
        \n\n4) '+Приседаниясвыпрыгиванием+'\n _'+up15f20+'_ \n\n5) '+Стульчик+'\n _'+up15f20+'_ \n\n6) '+Выпадывперед+'\n _'+up15f20+'_ \
        \n\n7) '+Подъемынаноскисвозвышением+'\n _'+up15f20+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'держать форму' and placing == 'в воркаут зоне' and time == '3 раза': #18.2 ТРИ ДНЯ
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time10+'_ \n\n3) '+Берпи+'\n _'+up10f12+'_ \
        \n\n4) '+Отжимания+'\n _'+up10f12+'_ \n\n5) '+Отжиманияуголком+'\n _'+up10f12+'_ \n\n6) '+Обратныеотжиманияотстула+'\n _'+up10f12+'_ \
        \n\n7) '+Отжиманияуголком+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time10+'_ \n\n3) '+Подтягивание+'\n _'+up10f12+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up10f12+'_ \n\n5) '+Охотничьясобака+'\n _'+up10f12+'_ \n\n6) '+Скручиваниянаскамье+'\n _'+up10f12+'_ \
        \n\n7) '+Охотничьясобака+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time10+'_ \n\n3) '+Приседания+'\n _'+up10f12+'_ \
        \n\n4) '+Приседаниясвыпрыгиванием+'\n _'+up10f12+'_ \n\n5) '+Стульчик+'\n _'+up10f12+'_ \n\n6) '+Выпадывперед+'\n _'+up10f12+'_ \
        \n\n7) '+Подъемногввисе+'\n _'+up10f12+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')
    elif sex == 'девушка' and aim == 'подкачаться' and placing == 'в воркаут зоне' and time == '3 раза': #18.3 ТРИ ДНЯ
        bot.send_message(
        message.from_user.id,'*Выполняйте '+time+' в неделю следующую тренировку:*\
        \n\n---1-ый день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time5+'_ \n\n3) '+Берпи+'\n _'+up8f10+'_ \
        \n\n4) '+Отжимания+'\n _'+up8f10+'_ \n\n5) '+Отжиманияуголком+'\n _'+up8f10+'_ \n\n6) '+Обратныеотжиманияотстула+'\n _'+up8f10+'_ \
        \n\n7) '+Отжиманияуголком+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\
        \n\n---2-ой день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time5+'_ \n\n3) '+Подтягивание+'\n _'+up8f10+'_ \
        \n\n4) '+Гиперэкстензия+'\n _'+up8f10+'_ \n\n5) '+Охотничьясобака+'\n _'+up8f10+'_ \n\n6) '+Скручиваниянаскамье+'\n _'+up8f10+'_ \
        \n\n7) '+Охотничьясобака+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\
        \n\n---3-ий день--- \
        \n\n1) '+Разминка+' \n\n2) '+Бегпоулице+'\n _'+time5+'_ \n\n3) '+Приседания+'\n _'+up8f10+'_ \
        \n\n4) '+Приседаниясвыпрыгиванием+'\n _'+up8f10+'_ \n\n5) '+Стульчик+'\n _'+up8f10+'_ \n\n6) '+Выпадывперед+'\n _'+up8f10+'_ \
        \n\n7) '+Подъемногввисе+'\n _'+up8f10+'_ \n\n8) '+Растяжка+'\n', parse_mode=telegram.ParseMode.MARKDOWN
        )
        bot.send_message(message.from_user.id,'Если хочешь получить программу питания, тыкни /start')

#EAT
def get_height(message):
    global height
    height = message.text
    bot.send_message(message.from_user.id,'Твой вес в кило?')
    bot.register_next_step_handler(message, get_weight)

def get_weight(message):
    global weight
    weight = message.text
    bot.send_message(message.from_user.id,'Твой возраст в цифрах?')
    bot.register_next_step_handler(message, get_age)

def get_age(message):
    global age
    age = message.text
    bot.send_message(message.from_user.id,'Твоя цель?',reply_markup=keyboard2)
    bot.register_next_step_handler(message, get_aim_eat)

def get_aim_eat(message):
    global aim_eat
    aim_eat = message.text
    calories = (10*int(weight) + 6.25*int(height) - 5*int(age) + 5)*1.54
    calories = round(calories)
    #1
    sush = int(calories) - 500
    kach = int(calories) + 500
    keep = int(calories)
    protein = int(weight)*1.5
    protein = round(protein)
    fats = int(weight)*1.2
    fats = round(fats)
    carbons1 = ( int(sush) - int(protein)*4 - int(fats)*9 ) //4
    carbons1 = round(carbons1)
    carbons2 = ( int(kach) - int(protein)*4 - int(fats)*9 ) //4
    carbons2 = round(carbons2)
    carbons3 = ( int(keep) - int(protein)*4 - int(fats)*9 ) //4
    carbons3 = round(carbons3)
    #2
    ovsyanka1 = int(carbons1)/8/14.2*100
    ovsyanka1 = round(ovsyanka1)
    apple1 = int(carbons1)/8/9.8*100
    apple1 = round(apple1)
    rice1 = int(carbons1)/5/25*100
    rice1 = round(rice1)
    bread1 = int(carbons1)/7.5/48*100
    bread1 = round(bread1)
    marmelad1 = int(carbons1)/8/80*100
    marmelad1 = round(marmelad1)
    honey1 = int(carbons1)/8/70*100
    honey1 = round(honey1)
    chicken = int(protein)/2.5/31*100
    chicken = round(chicken)
    tvorog = int(protein)/3/17*100
    tvorog = round(tvorog)
    avocado = int(fats)/8.5/15*100
    avocado = round(avocado)
    nuts = int(fats)/3.2/56*100
    nuts = round(nuts)
    #2.1
    ovsyanka2 = int(carbons2)/8/14.2*100
    ovsyanka2 = round(ovsyanka2)
    apple2 = int(carbons2)/8/9.8*100
    apple2 = round(apple2)
    rice2 = int(carbons2)/5/25*100
    rice2 = round(rice2)
    bread2 = int(carbons2)/7.5/48*100
    bread2 = round(bread2)
    marmelad2 = int(carbons2)/8/80*100
    marmelad2 = round(marmelad2)
    honey2 = int(carbons2)/8/70*100
    honey2 = round(honey2)
    #2.2
    ovsyanka3 = int(carbons3)/8/14.2*100
    ovsyanka3 = round(ovsyanka3)
    apple3 = int(carbons3)/8/9.8*100
    apple3 = round(apple3)
    rice3 = int(carbons3)/5/25*100
    rice3 = round(rice3)
    bread3 = int(carbons3)/7.5/48*100
    bread3 = round(bread3)
    marmelad3 = int(carbons3)/8/80*100
    marmelad3 = round(marmelad3)
    honey3 = int(carbons3)/8/70*100
    honey3 = round(honey3)


    if aim_eat == 'подсушиться': #1 ==VARIANT==

        bot.send_message(
        message.from_user.id,'Ваша программа питания готова! Суточная норма - '+str(sush)+' _каллорий_. \
        \n Углеводы - '+str(carbons1)+' _гр_ \n Белки - '+str(protein)+' _гр_ \n Жиры - '+str(fats)+' _гр_', parse_mode=telegram.ParseMode.MARKDOWN)

        bot.send_message(
        message.from_user.id, '*Рацион питания*\
        \n\n    -_Завтрак_-\
        \n '+Овсянка+' - '+str(ovsyanka1)+' гр\
        \n '+Яблоко+' - '+str(apple1)+' гр\
        \n\n    -_Обед_-\
        \n '+Куринаягрудка+' - '+str(chicken)+' гр\
        \n '+Рис+' - '+str(rice1)+' гр\
        \n '+Хлеб+' - '+str(bread1)+' гр\
        \n '+Авокадо+' - '+str(avocado)+' гр\
        \n '+Мармелад+' - '+str(marmelad1)+' гр\
        \n\n    -_После тренировки_-\
        \n '+Горькийшоколад+' - 50 гр\
        \n '+Орехи+' - '+str(nuts)+' гр\
        \n\n    -_Ужин_-\
        \n '+Творогсмолоком+' - '+str(tvorog)+' гр\
        \n '+Медваренье+' - '+str(honey1)+' гр', parse_mode=telegram.ParseMode.MARKDOWN)

    elif aim_eat == 'подкачаться':

        bot.send_message(
        message.from_user.id,'Ваша программа питания готова! Суточная норма - '+str(kach)+' _каллорий_. \
        \n Углеводы - '+str(carbons2)+' _гр_ \n Белки - '+str(protein)+' _гр_ \n Жиры - '+str(fats)+' _гр_', parse_mode=telegram.ParseMode.MARKDOWN)

        bot.send_message(
        message.from_user.id, '*Рацион питания*\
        \n\n    -_Завтрак_-\
        \n '+Овсянка+' - '+str(ovsyanka2)+' гр\
        \n '+Яблоко+' - '+str(apple2)+' гр\
        \n\n    -_Обед_-\
        \n '+Куринаягрудка+' - '+str(chicken)+' гр\
        \n '+Рис+' - '+str(rice2)+' гр\
        \n '+Хлеб+' - '+str(bread2)+' гр\
        \n '+Авокадо+' - '+str(avocado)+' гр\
        \n '+Мармелад+' - '+str(marmelad2)+' гр\
        \n\n    -_После тренировки_-\
        \n '+Горькийшоколад+' - 50 гр\
        \n '+Орехи+' - '+str(nuts)+' гр\
        \n\n    -_Ужин_-\
        \n '+Творогсмолоком+' - '+str(tvorog)+' гр\
        \n '+Медваренье+' - '+str(honey2)+' гр', parse_mode=telegram.ParseMode.MARKDOWN)

    elif aim_eat == 'держать форму':

        bot.send_message(
        message.from_user.id,'Ваша программа питания готова! Суточная норма - '+str(keep)+' _каллорий_. \
        \n Углеводы - '+str(carbons3)+' _гр_ \n Белки - '+str(protein)+' _гр_ \n Жиры - '+str(fats)+' _гр_', parse_mode=telegram.ParseMode.MARKDOWN)

        bot.send_message(
        message.from_user.id, '*Рацион питания*\
        \n\n    -_Завтрак_-\
        \n '+Овсянка+' - '+str(ovsyanka3)+' гр\
        \n '+Яблоко+' - '+str(apple3)+' гр\
        \n\n    -_Обед_-\
        \n '+Куринаягрудка+' - '+str(chicken)+' гр\
        \n '+Рис+' - '+str(rice3)+' гр\
        \n '+Хлеб+' - '+str(bread3)+' гр\
        \n '+Авокадо+' - '+str(avocado)+' гр\
        \n '+Мармелад+' - '+str(marmelad3)+' гр\
        \n\n    -_После тренировки_-\
        \n '+Горькийшоколад+' - 50 гр\
        \n '+Орехи+' - '+str(nuts)+' гр\
        \n\n    -_Ужин_-\
        \n '+Творогсмолоком+' - '+str(tvorog)+' гр\
        \n '+Медваренье+' - '+str(honey3)+' гр', parse_mode=telegram.ParseMode.MARKDOWN)


#GLOBALS
name = ''
sex = ''
age = 0
aim = ''
aim_eat = ''
placing = ''
bulk = ''
health = ''
time = ''
height = 0
weight = 0
activity = ''
register =''


#ARRAYS
Разминка='Разминка'
Бегнабеговойдорожке='Бег на беговой дорожке'
Скручиваниянаскамье='Скручивания на скамье'
Гиперэкстензия='Гиперэкстензия'
Приседсоштангой='Присед со штангой'
Жимлежа='Жим лежа'
Тягаверхнегоблока='Тяга верхнего блока'
Подтягиванияобратнымхватом='Подтягивания обратным хватом'
Растяжка='Растяжка'
Бегполестнице='Бег по лестнице'
Берпи='Берпи'
Приседания='Приседания'
Отжимания='Отжимания'
Охотничьясобака='Охотничья собака'
Обратныеотжиманияотстула='Обратные отжимания от стула'
Велосипед='Велосипед'
Подтягивание='Подтягивание'
Отжиманияуголком='Отжимания уголком'
Отжиманиянабрусьях='Отжимания на брусьях'
Приседаниясвыпрыгиванием='Приседания с выпрыгиванием'
Подъемынаноскисвозвышением='Подъемы на носки с возвышением'
Гиперэкстензия='Гиперэкстензия'
Бегпоулице='Бег по улице'
Становаятяга='Становая тяга'
Приседаниясоштангой='Приседания со штангой'
Тягаверхнегоблока='Тяга верхнего блока'
ТягаТгрифа='Тяга Т-грифа'
Эллипсоид='Эллипсоид'
Сведениеруквбабочке='Сведение рук в бабочке'
Армейскийжимвтренажере='Армейский жим в тренажере'
Французскийжим='Французский жим'
Сгибаниеруксгантелямисоступинацией='Сгибание рук с гантелями со ступинацией'
Приседаниясвыпрыгиванием='Приседания с выпрыгиванием'
Выпадывперед='Выпады вперед'
Стульчик='Стульчик'
Книжка='Книжка'
Треугольныеотжимания='Треугольные отжимания'
Поднятиетяжестипередсобой='Поднятие тяжести перед собой'
Горизонтальныеподтягивания='Горизонтальные подтягивания'
Сгибаниеруксоштангой='Сгибание рук со штангой'
Жимлежаузкимхватом='Жимлежа узким хватом'
Тягаштангикгрудистоя='Тяга штанги к груди стоя'
Разгибаниеногвтренажере='Разгибание ног в тренажере'
Cгибаниеногвтренажере='Cгибание ног в тренажере'
Скручиваниенаскамье='Скручивание на скамье'
Уголок='Уголок'
Подъемногввисе='Подъем ног в висе'
Выпадысгантелями='Выпады с гантелями'
ЯгодичныймоствСмите='Ягодичный мост в Смите'
Ягодичныймост='Ягодичный мост'
Подтягиваниявгравитронеобратнымхватом='Подтягивания в гравитроне обратным хватом'
Жимплатформы='Жим платформы'
Сведениеруклежа='Сведение рук лежа'
Жимвхаммере='Жим в хаммере'

time5='5 минут'
time10='10 минут'
time20='20 минут'

up15f20='4 подхода по 15-20 раз'
up10f12='4 подхода по 10-12 раз'
up8f10='4 подхода по 8-10 раз'

#EAT ARRAYS
Творогсмолоком='Творог с молоком'
Яйца='Яйца'
Банан='Банан'
Яблоко='Яблоко'
Овсянка='Овсянка'
Гречка='Гречка отварная'
Рис='Рис отварной'
Макароны='Макароны отварные'
Помидоры='Помидоры'
Огурцы='Огурцы'
Куринаягрудка='Куриная грудка'
Молоко='Молоко'
Авокадо='Авокадо'
Хлеб='Хлеб'
Горькийшоколад='Горький шоколад'
Индейка='Индейка'
Орехи='Орехи'
Медваренье='Мед / Варенье'
Мармелад='Мармелад'
Авокадо='Авокадо'

яичницаомлет='Яичница / Омлет'
банан='Банан'
индейка='Индейка'
макароны='Макароны'
овощи='Овощи'




#BUTTONS
@bot.callback_query_handler(func=lambda call: True) #TRAINING
def callback_worker(call):
    if call.data == "yes":
        bot.send_message(call.message.chat.id, 'Запомню! Если хочешь составить твой план питания, тыкни /start')
    elif call.data == "no":
        bot.send_message(call.message.chat.id, 'Где-то ошибся? Давай по-новой! Тыкни /reg')

#KEYBOARDS
keyboard1 = telebot.types.ReplyKeyboardMarkup(True, True)
keyboard1.add('парень', 'девушка')
keyboard2 = telebot.types.ReplyKeyboardMarkup(True, True)
keyboard2.add('подсушиться', 'подкачаться', 'держать форму')
keyboard3 = telebot.types.ReplyKeyboardMarkup(True, True)
keyboard3.add('в зале', 'в воркаут зоне', 'дома')
keyboard4 = telebot.types.ReplyKeyboardMarkup(True, True)
keyboard4.add('эктоморф', 'мезоморф', 'эндоморф')
keyboard5 = telebot.types.ReplyKeyboardMarkup(True, True)
keyboard5.add('проблема 1', 'проблема 2', 'все в порядке')
keyboard6 = telebot.types.ReplyKeyboardMarkup(True, True)
keyboard6.add('активность 1', 'активность 2', 'активность 3')
keyboard7 = telebot.types.ReplyKeyboardMarkup(True, True)
keyboard7.add('/reg', '/start')
keyboard8 = telebot.types.ReplyKeyboardMarkup(True, True)
keyboard8.add('1 раз', '2 раза', '3 раза')
keyboard9 = telebot.types.ReplyKeyboardMarkup(True, True)
keyboard9.add('Да')
keyboard10 = telebot.types.ReplyKeyboardMarkup(True, True)
keyboard10.add('Питание', 'Тренировка')
keyboard11 = telebot.types.ReplyKeyboardMarkup(True, True)
keyboard11.add('/start')


bot.polling(none_stop=True, interval=0)
